Namespace(K=3, batch_size=256, decay_rate=0.01, learning_rate=0.0001, n_epochs=20, nbins=200, num_test=20000, num_train=200000, prtb=False, resampleTrain=False, rm_band=False, select_per_bin=400, sim='lsst')
Training on sim:  lsst
X training data shape:  (2400000, 6)
y training data shape:  (2400000,)
----------
number of datapoints:  2400000
z-minmax:  0.04873446602157439 1.4241888290012907
ColMag-min:  [-0.165 -0.164 -0.152 -0.1   -0.081 13.094]
ColMag-max:  [ 2.834  2.26   1.679  1.023  0.943 34.313]
----------
----------
number of datapoints:  1200000
z-minmax:  0.04873446602157439 1.4241888290012907
ColMag-min:  [-0.165 -0.163 -0.152 -0.1   -0.081 13.094]
ColMag-max:  [ 2.834  2.26   1.676  1.023  0.943 34.313]
----------
Size of features in training data: (1200000, 6)
Size of output in training data: (1200000,)
Size of features in test data: (1200000, 6)
Size of output in test data: (1200000,)
----------
number of datapoints:  1200000
z-minmax:  0.0 1.0
ColMag-min:  [-1.417 -1.709 -2.134 -2.164 -1.769 -3.264]
ColMag-max:  [4.463 3.829 4.163 3.315 3.499 4.36 ]
----------
----------
number of datapoints:  1200000
z-minmax:  0.0 1.0
ColMag-min:  [-1.416 -1.707 -2.134 -2.164 -1.769 -3.264]
ColMag-max:  [4.463 3.83  4.151 3.318 3.5   4.36 ]
----------
before first savefig
after first savefig
Model: "mdn"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 6)]          0                                            
__________________________________________________________________________________________________
dense (Dense)                   (None, 512)          3584        input_2[0][0]                    
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1024)         525312      dense[0][0]                      
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 2048)         2099200     dense_1[0][0]                    
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 1024)         2098176     dense_2[0][0]                    
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 512)          524800      dense_3[0][0]                    
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 256)          131328      dense_4[0][0]                    
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 128)          32896       dense_5[0][0]                    
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 64)           8256        dense_6[0][0]                    
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 32)           2080        dense_7[0][0]                    
__________________________________________________________________________________________________
sigma (Dense)                   (None, 3)            99          dense_8[0][0]                    
__________________________________________________________________________________________________
input_1 (InputLayer)            [(None, 1)]          0                                            
__________________________________________________________________________________________________
mu (Dense)                      (None, 3)            99          dense_8[0][0]                    
__________________________________________________________________________________________________
tf.math.exp (TFOpLambda)        (None, 3)            0           sigma[0][0]                      
__________________________________________________________________________________________________
mixing (Dense)                  (None, 3)            99          dense_8[0][0]                    
__________________________________________________________________________________________________
tf.compat.v1.transpose (TFOpLam (1, None)            0           input_1[0][0]                    
__________________________________________________________________________________________________
tf.convert_to_tensor_3 (TFOpLam (1, None)            0           tf.compat.v1.transpose[0][0]     
__________________________________________________________________________________________________
tf.compat.v1.shape_1 (TFOpLambd (2,)                 0           tf.convert_to_tensor_3[0][0]     
__________________________________________________________________________________________________
tf.__operators__.getitem_1 (Sli (2,)                 0           tf.compat.v1.shape_1[0][0]       
__________________________________________________________________________________________________
tf.__operators__.getitem_2 (Sli (0,)                 0           tf.compat.v1.shape_1[0][0]       
__________________________________________________________________________________________________
tf.concat (TFOpLambda)          (3,)                 0           tf.__operators__.getitem_1[0][0] 
                                                                 tf.__operators__.getitem_2[0][0] 
__________________________________________________________________________________________________
tf.reshape (TFOpLambda)         (1, None, 1)         0           tf.convert_to_tensor_3[0][0]     
                                                                 tf.concat[0][0]                  
__________________________________________________________________________________________________
tf.convert_to_tensor_1 (TFOpLam (None, 3)            0           mu[0][0]                         
__________________________________________________________________________________________________
tf.convert_to_tensor_4 (TFOpLam (1, None, 1)         0           tf.reshape[0][0]                 
__________________________________________________________________________________________________
tf.identity (TFOpLambda)        (None, 3)            0           tf.convert_to_tensor_1[0][0]     
__________________________________________________________________________________________________
tf.convert_to_tensor_2 (TFOpLam (None, 3)            0           tf.math.exp[0][0]                
__________________________________________________________________________________________________
tf.math.subtract (TFOpLambda)   (1, None, 3)         0           tf.convert_to_tensor_4[0][0]     
                                                                 tf.identity[0][0]                
__________________________________________________________________________________________________
tf.identity_1 (TFOpLambda)      (None, 3)            0           tf.convert_to_tensor_2[0][0]     
__________________________________________________________________________________________________
tf.math.truediv (TFOpLambda)    (1, None, 3)         0           tf.math.subtract[0][0]           
                                                                 tf.identity_1[0][0]              
__________________________________________________________________________________________________
tf.math.square (TFOpLambda)     (1, None, 3)         0           tf.math.truediv[0][0]            
__________________________________________________________________________________________________
tf.math.log_1 (TFOpLambda)      (None, 3)            0           tf.identity_1[0][0]              
__________________________________________________________________________________________________
tf.convert_to_tensor (TFOpLambd (None, 3)            0           mixing[0][0]                     
__________________________________________________________________________________________________
tf.math.multiply (TFOpLambda)   (1, None, 3)         0           tf.math.square[0][0]             
__________________________________________________________________________________________________
tf.__operators__.add (TFOpLambd (None, 3)            0           tf.math.log_1[0][0]              
__________________________________________________________________________________________________
tf.math.log (TFOpLambda)        (None, 3)            0           tf.convert_to_tensor[0][0]       
__________________________________________________________________________________________________
tf.math.subtract_1 (TFOpLambda) (1, None, 3)         0           tf.math.multiply[0][0]           
                                                                 tf.__operators__.add[0][0]       
__________________________________________________________________________________________________
tf.nn.log_softmax (TFOpLambda)  (None, 3)            0           tf.math.log[0][0]                
__________________________________________________________________________________________________
tf.__operators__.add_1 (TFOpLam (1, None, 3)         0           tf.math.subtract_1[0][0]         
                                                                 tf.nn.log_softmax[0][0]          
__________________________________________________________________________________________________
tf.math.reduce_logsumexp (TFOpL (1, None)            0           tf.__operators__.add_1[0][0]     
__________________________________________________________________________________________________
tf.math.multiply_1 (TFOpLambda) (1, None)            0           tf.math.reduce_logsumexp[0][0]   
__________________________________________________________________________________________________
tf.math.reduce_mean (TFOpLambda ()                   0           tf.math.multiply_1[0][0]         
__________________________________________________________________________________________________
add_loss (AddLoss)              ()                   0           tf.math.reduce_mean[0][0]        
==================================================================================================
Total params: 5,425,929
Trainable params: 5,425,929
Non-trainable params: 0
__________________________________________________________________________________________________
Epoch 1/20
   1/4219 [..............................] - ETA: 6:06:23 - loss: 1.6657   2/4219 [..............................] - ETA: 12:02 - loss: 1.6658     3/4219 [..............................] - ETA: 13:30 - loss: 1.6649   5/4219 [..............................] - ETA: 8:15 - loss: 1.6629    6/4219 [..............................] - ETA: 7:23 - loss: 1.6616   8/4219 [..............................] - ETA: 6:14 - loss: 1.6585  10/4219 [..............................] - ETA: 5:31 - loss: 1.6547  12/4219 [..............................] - ETA: 5:05 - loss: 1.6492  14/4219 [..............................] - ETA: 4:50 - loss: 1.6410  15/4219 [..............................] - ETA: 4:46 - loss: 1.6357  17/4219 [..............................] - ETA: 4:32 - loss: 1.6228  18/4219 [..............................] - ETA: 4:30 - loss: 1.6155  19/4219 [..............................] - ETA: 4:27 - loss: 1.6077  21/4219 [..............................] - ETA: 4:19 - loss: 1.5915  23/4219 [..............................] - ETA: 4:14 - loss: 1.5750  25/4219 [..............................] - ETA: 4:09 - loss: 1.5587  26/4219 [..............................] - ETA: 4:08 - loss: 1.5507  27/4219 [..............................] - ETA: 4:06 - loss: 1.5427  29/4219 [..............................] - ETA: 4:01 - loss: 1.5272  30/4219 [..............................] - ETA: 4:02 - loss: 1.5197  32/4219 [..............................] - ETA: 4:00 - loss: 1.5051  34/4219 [..............................] - ETA: 3:57 - loss: 1.4911  36/4219 [..............................] - ETA: 3:55 - loss: 1.4778  37/4219 [..............................] - ETA: 3:55 - loss: 1.4714  39/4219 [..............................] - ETA: 3:53 - loss: 1.4590