Namespace(D=5, K=3, batch_size=1024, decay_rate=0.001, learning_rate='0.001', n_epochs=100, nbins=200, num_test=20000, num_train=200000, resampleTrain=True, select_per_bin=400)
0.001
0.0010.0010.0010.0010.001
----------
number of datapoints:  187462
z-minmax:  0.0020016062 1.249997
ColMag-min:  [-0.09145837 -0.05327791 -0.02479261 -0.10519464 12.000012  ]
ColMag-max:  [ 3.825315   2.8303378  1.6937237  1.5019817 23.499979 ]
----------
----------
number of datapoints:  10322
z-minmax:  0.0020014732 1.249283
ColMag-min:  [-4.1676056e-02 -7.1866615e-03  5.6203555e-02 -6.4645730e-02
  1.2003667e+01]
ColMag-max:  [ 3.6190994  2.7985296  1.6097487  1.4396983 23.4981   ]
----------
----------
number of datapoints:  4339
z-minmax:  7.926745e-06 7.01
ColMag-min:  [ -5.188479   -3.8901405  -2.1034117 -15.92296    12.114799 ]
ColMag-max:  [17.02884   7.925968  4.182415  2.264679 25.709858]
----------
(79600,)
Size of features in training data: (79600, 5)
Size of output in training data: (79600,)
Size of features in test data: (2767, 5)
Size of output in test data: (2767,)
----------
number of datapoints:  79600
z-minmax:  0.0 1.0000001
ColMag-min:  [-1.6507052 -2.2788894 -2.3348138 -2.2950504 -4.2421055]
ColMag-max:  [4.724002  4.212091  3.5302377 3.8734057 1.2678376]
----------
----------
number of datapoints:  2767
z-minmax:  -0.0015975338 0.8793446
ColMag-min:  [-1.6387041 -2.2345772 -2.3220117 -2.3038087 -4.1878986]
ColMag-max:  [4.745621  4.1498146 3.6145232 3.919013  1.0281243]
----------
Model: "mdn"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 5)]          0                                            
__________________________________________________________________________________________________
dense (Dense)                   (None, 512)          3072        input_2[0][0]                    
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1024)         525312      dense[0][0]                      
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 2048)         2099200     dense_1[0][0]                    
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 1024)         2098176     dense_2[0][0]                    
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 512)          524800      dense_3[0][0]                    
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 256)          131328      dense_4[0][0]                    
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 128)          32896       dense_5[0][0]                    
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 64)           8256        dense_6[0][0]                    
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 32)           2080        dense_7[0][0]                    
__________________________________________________________________________________________________
sigma (Dense)                   (None, 3)            99          dense_8[0][0]                    
__________________________________________________________________________________________________
input_1 (InputLayer)            [(None, 1)]          0                                            
__________________________________________________________________________________________________
mu (Dense)                      (None, 3)            99          dense_8[0][0]                    
__________________________________________________________________________________________________
tf.math.exp (TFOpLambda)        (None, 3)            0           sigma[0][0]                      
__________________________________________________________________________________________________
mixing (Dense)                  (None, 3)            99          dense_8[0][0]                    
__________________________________________________________________________________________________
tf.compat.v1.transpose (TFOpLam (1, None)            0           input_1[0][0]                    
__________________________________________________________________________________________________
tf.convert_to_tensor_3 (TFOpLam (1, None)            0           tf.compat.v1.transpose[0][0]     
__________________________________________________________________________________________________
tf.compat.v1.shape_1 (TFOpLambd (2,)                 0           tf.convert_to_tensor_3[0][0]     
__________________________________________________________________________________________________
tf.__operators__.getitem_1 (Sli (2,)                 0           tf.compat.v1.shape_1[0][0]       
__________________________________________________________________________________________________
tf.__operators__.getitem_2 (Sli (0,)                 0           tf.compat.v1.shape_1[0][0]       
__________________________________________________________________________________________________
tf.concat (TFOpLambda)          (3,)                 0           tf.__operators__.getitem_1[0][0] 
                                                                 tf.__operators__.getitem_2[0][0] 
__________________________________________________________________________________________________
tf.reshape (TFOpLambda)         (1, None, 1)         0           tf.convert_to_tensor_3[0][0]     
                                                                 tf.concat[0][0]                  
__________________________________________________________________________________________________
tf.convert_to_tensor_1 (TFOpLam (None, 3)            0           mu[0][0]                         
__________________________________________________________________________________________________
tf.convert_to_tensor_4 (TFOpLam (1, None, 1)         0           tf.reshape[0][0]                 
__________________________________________________________________________________________________
tf.identity (TFOpLambda)        (None, 3)            0           tf.convert_to_tensor_1[0][0]     
__________________________________________________________________________________________________
tf.convert_to_tensor_2 (TFOpLam (None, 3)            0           tf.math.exp[0][0]                
__________________________________________________________________________________________________
tf.math.subtract (TFOpLambda)   (1, None, 3)         0           tf.convert_to_tensor_4[0][0]     
                                                                 tf.identity[0][0]                
__________________________________________________________________________________________________
tf.identity_1 (TFOpLambda)      (None, 3)            0           tf.convert_to_tensor_2[0][0]     
__________________________________________________________________________________________________
tf.math.truediv (TFOpLambda)    (1, None, 3)         0           tf.math.subtract[0][0]           
                                                                 tf.identity_1[0][0]              
__________________________________________________________________________________________________
tf.math.square (TFOpLambda)     (1, None, 3)         0           tf.math.truediv[0][0]            
__________________________________________________________________________________________________
tf.math.log_1 (TFOpLambda)      (None, 3)            0           tf.identity_1[0][0]              
__________________________________________________________________________________________________
tf.convert_to_tensor (TFOpLambd (None, 3)            0           mixing[0][0]                     
__________________________________________________________________________________________________
tf.math.multiply (TFOpLambda)   (1, None, 3)         0           tf.math.square[0][0]             
__________________________________________________________________________________________________
tf.__operators__.add (TFOpLambd (None, 3)            0           tf.math.log_1[0][0]              
__________________________________________________________________________________________________
tf.math.log (TFOpLambda)        (None, 3)            0           tf.convert_to_tensor[0][0]       
__________________________________________________________________________________________________
tf.math.subtract_1 (TFOpLambda) (1, None, 3)         0           tf.math.multiply[0][0]           
                                                                 tf.__operators__.add[0][0]       
__________________________________________________________________________________________________
tf.nn.log_softmax (TFOpLambda)  (None, 3)            0           tf.math.log[0][0]                
__________________________________________________________________________________________________
tf.__operators__.add_1 (TFOpLam (1, None, 3)         0           tf.math.subtract_1[0][0]         
                                                                 tf.nn.log_softmax[0][0]          
__________________________________________________________________________________________________
tf.math.reduce_logsumexp (TFOpL (1, None)            0           tf.__operators__.add_1[0][0]     
__________________________________________________________________________________________________
tf.math.multiply_1 (TFOpLambda) (1, None)            0           tf.math.reduce_logsumexp[0][0]   
__________________________________________________________________________________________________
tf.math.reduce_mean (TFOpLambda ()                   0           tf.math.multiply_1[0][0]         
__________________________________________________________________________________________________
add_loss (AddLoss)              ()                   0           tf.math.reduce_mean[0][0]        
==================================================================================================
Total params: 5,425,417
Trainable params: 5,425,417
Non-trainable params: 0
__________________________________________________________________________________________________
Epoch 1/100
