Namespace(D=5, K=3, batch_size=1024, decay_rate=0.001, learning_rate=0.0001, n_epochs=100, nbins=200, num_test=20000, num_train=200000, resampleTrain=True, select_per_bin=400)
0.0001
0.0005
----------
number of datapoints:  187462
z-minmax:  0.0020016062 1.249997
ColMag-min:  [-0.09145837 -0.05327791 -0.02479261 -0.10519464 12.000012  ]
ColMag-max:  [ 3.825315   2.8303378  1.6937237  1.5019817 23.499979 ]
----------
----------
number of datapoints:  10322
z-minmax:  0.0020014732 1.249283
ColMag-min:  [-4.1676056e-02 -7.1866615e-03  5.6203555e-02 -6.4645730e-02
  1.2003667e+01]
ColMag-max:  [ 3.6190994  2.7985296  1.6097487  1.4396983 23.4981   ]
----------
----------
number of datapoints:  4339
z-minmax:  7.926745e-06 7.01
ColMag-min:  [ -5.188479   -3.8901405  -2.1034117 -15.92296    12.114799 ]
ColMag-max:  [17.02884   7.925968  4.182415  2.264679 25.709858]
----------
(79600,)
Size of features in training data: (79600, 5)
Size of output in training data: (79600,)
Size of features in test data: (2767, 5)
Size of output in test data: (2767,)
----------
number of datapoints:  79600
z-minmax:  0.0 1.0000001
ColMag-min:  [-1.6507052 -2.2788894 -2.3348138 -2.2950504 -4.2421055]
ColMag-max:  [4.724002  4.212091  3.5302377 3.8734057 1.2678376]
----------
----------
number of datapoints:  2767
z-minmax:  -0.0015975338 0.8793446
ColMag-min:  [-1.6387041 -2.2345772 -2.3220117 -2.3038087 -4.1878986]
ColMag-max:  [4.745621  4.1498146 3.6145232 3.919013  1.0281243]
----------
Model: "mdn"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 5)]          0                                            
__________________________________________________________________________________________________
dense (Dense)                   (None, 512)          3072        input_2[0][0]                    
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1024)         525312      dense[0][0]                      
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 2048)         2099200     dense_1[0][0]                    
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 1024)         2098176     dense_2[0][0]                    
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 512)          524800      dense_3[0][0]                    
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 256)          131328      dense_4[0][0]                    
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 128)          32896       dense_5[0][0]                    
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 64)           8256        dense_6[0][0]                    
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 32)           2080        dense_7[0][0]                    
__________________________________________________________________________________________________
sigma (Dense)                   (None, 3)            99          dense_8[0][0]                    
__________________________________________________________________________________________________
input_1 (InputLayer)            [(None, 1)]          0                                            
__________________________________________________________________________________________________
mu (Dense)                      (None, 3)            99          dense_8[0][0]                    
__________________________________________________________________________________________________
tf.math.exp (TFOpLambda)        (None, 3)            0           sigma[0][0]                      
__________________________________________________________________________________________________
mixing (Dense)                  (None, 3)            99          dense_8[0][0]                    
__________________________________________________________________________________________________
tf.compat.v1.transpose (TFOpLam (1, None)            0           input_1[0][0]                    
__________________________________________________________________________________________________
tf.convert_to_tensor_3 (TFOpLam (1, None)            0           tf.compat.v1.transpose[0][0]     
__________________________________________________________________________________________________
tf.compat.v1.shape_1 (TFOpLambd (2,)                 0           tf.convert_to_tensor_3[0][0]     
__________________________________________________________________________________________________
tf.__operators__.getitem_1 (Sli (2,)                 0           tf.compat.v1.shape_1[0][0]       
__________________________________________________________________________________________________
tf.__operators__.getitem_2 (Sli (0,)                 0           tf.compat.v1.shape_1[0][0]       
__________________________________________________________________________________________________
tf.concat (TFOpLambda)          (3,)                 0           tf.__operators__.getitem_1[0][0] 
                                                                 tf.__operators__.getitem_2[0][0] 
__________________________________________________________________________________________________
tf.reshape (TFOpLambda)         (1, None, 1)         0           tf.convert_to_tensor_3[0][0]     
                                                                 tf.concat[0][0]                  
__________________________________________________________________________________________________
tf.convert_to_tensor_1 (TFOpLam (None, 3)            0           mu[0][0]                         
__________________________________________________________________________________________________
tf.convert_to_tensor_4 (TFOpLam (1, None, 1)         0           tf.reshape[0][0]                 
__________________________________________________________________________________________________
tf.identity (TFOpLambda)        (None, 3)            0           tf.convert_to_tensor_1[0][0]     
__________________________________________________________________________________________________
tf.convert_to_tensor_2 (TFOpLam (None, 3)            0           tf.math.exp[0][0]                
__________________________________________________________________________________________________
tf.math.subtract (TFOpLambda)   (1, None, 3)         0           tf.convert_to_tensor_4[0][0]     
                                                                 tf.identity[0][0]                
__________________________________________________________________________________________________
tf.identity_1 (TFOpLambda)      (None, 3)            0           tf.convert_to_tensor_2[0][0]     
__________________________________________________________________________________________________
tf.math.truediv (TFOpLambda)    (1, None, 3)         0           tf.math.subtract[0][0]           
                                                                 tf.identity_1[0][0]              
__________________________________________________________________________________________________
tf.math.square (TFOpLambda)     (1, None, 3)         0           tf.math.truediv[0][0]            
__________________________________________________________________________________________________
tf.math.log_1 (TFOpLambda)      (None, 3)            0           tf.identity_1[0][0]              
__________________________________________________________________________________________________
tf.convert_to_tensor (TFOpLambd (None, 3)            0           mixing[0][0]                     
__________________________________________________________________________________________________
tf.math.multiply (TFOpLambda)   (1, None, 3)         0           tf.math.square[0][0]             
__________________________________________________________________________________________________
tf.__operators__.add (TFOpLambd (None, 3)            0           tf.math.log_1[0][0]              
__________________________________________________________________________________________________
tf.math.log (TFOpLambda)        (None, 3)            0           tf.convert_to_tensor[0][0]       
__________________________________________________________________________________________________
tf.math.subtract_1 (TFOpLambda) (1, None, 3)         0           tf.math.multiply[0][0]           
                                                                 tf.__operators__.add[0][0]       
__________________________________________________________________________________________________
tf.nn.log_softmax (TFOpLambda)  (None, 3)            0           tf.math.log[0][0]                
__________________________________________________________________________________________________
tf.__operators__.add_1 (TFOpLam (1, None, 3)         0           tf.math.subtract_1[0][0]         
                                                                 tf.nn.log_softmax[0][0]          
__________________________________________________________________________________________________
tf.math.reduce_logsumexp (TFOpL (1, None)            0           tf.__operators__.add_1[0][0]     
__________________________________________________________________________________________________
tf.math.multiply_1 (TFOpLambda) (1, None)            0           tf.math.reduce_logsumexp[0][0]   
__________________________________________________________________________________________________
tf.math.reduce_mean (TFOpLambda ()                   0           tf.math.multiply_1[0][0]         
__________________________________________________________________________________________________
add_loss (AddLoss)              ()                   0           tf.math.reduce_mean[0][0]        
==================================================================================================
Total params: 5,425,417
Trainable params: 5,425,417
Non-trainable params: 0
__________________________________________________________________________________________________
Epoch 1/100
 1/70 [..............................] - ETA: 1:40 - loss: 1.6479 2/70 [..............................] - ETA: 6s - loss: 1.6469   3/70 [>.............................] - ETA: 9s - loss: 1.6457 5/70 [=>............................] - ETA: 5s - loss: 1.6437 7/70 [==>...........................] - ETA: 4s - loss: 1.6414 9/70 [==>...........................] - ETA: 3s - loss: 1.638611/70 [===>..........................] - ETA: 3s - loss: 1.635213/70 [====>.........................] - ETA: 3s - loss: 1.631115/70 [=====>........................] - ETA: 2s - loss: 1.625817/70 [======>.......................] - ETA: 2s - loss: 1.619419/70 [=======>......................] - ETA: 2s - loss: 1.611921/70 [========>.....................] - ETA: 2s - loss: 1.603423/70 [========>.....................] - ETA: 2s - loss: 1.593925/70 [=========>....................] - ETA: 2s - loss: 1.583427/70 [==========>...................] - ETA: 1s - loss: 1.572529/70 [===========>..................] - ETA: 1s - loss: 1.561331/70 [============>.................] - ETA: 1s - loss: 1.549732/70 [============>.................] - ETA: 1s - loss: 1.543933/70 [=============>................] - ETA: 1s - loss: 1.538034/70 [=============>................] - ETA: 1s - loss: 1.532236/70 [==============>...............] - ETA: 1s - loss: 1.520538/70 [===============>..............] - ETA: 1s - loss: 1.509339/70 [===============>..............] - ETA: 1s - loss: 1.503840/70 [================>.............] - ETA: 1s - loss: 1.498442/70 [=================>............] - ETA: 1s - loss: 1.487743/70 [=================>............] - ETA: 1s - loss: 1.482544/70 [=================>............] - ETA: 1s - loss: 1.477346/70 [==================>...........] - ETA: 1s - loss: 1.467248/70 [===================>..........] - ETA: 1s - loss: 1.457450/70 [====================>.........] - ETA: 0s - loss: 1.447852/70 [=====================>........] - ETA: 0s - loss: 1.438653/70 [=====================>........] - ETA: 0s - loss: 1.434155/70 [======================>.......] - ETA: 0s - loss: 1.425357/70 [=======================>......] - ETA: 0s - loss: 1.416959/70 [========================>.....] - ETA: 0s - loss: 1.408861/70 [=========================>....] - ETA: 0s - loss: 1.401063/70 [==========================>...] - ETA: 0s - loss: 1.393465/70 [==========================>...] - ETA: 0s - loss: 1.386067/70 [===========================>..] - ETA: 0s - loss: 1.378969/70 [============================>.] - ETA: 0s - loss: 1.372170/70 [==============================] - 5s 53ms/step - loss: 1.3654 - val_loss: 0.9221

Learning rate for epoch 1 is 9.999999747378752e-05
Epoch 2/100
 1/70 [..............................] - ETA: 4s - loss: 0.9255 2/70 [..............................] - ETA: 3s - loss: 0.9256 3/70 [>.............................] - ETA: 3s - loss: 0.9256 4/70 [>.............................] - ETA: 3s - loss: 0.9257 5/70 [=>............................] - ETA: 3s - loss: 0.9257 7/70 [==>...........................] - ETA: 3s - loss: 0.9259 9/70 [==>...........................] - ETA: 2s - loss: 0.926311/70 [===>..........................] - ETA: 2s - loss: 0.927113/70 [====>.........................] - ETA: 2s - loss: 0.928215/70 [=====>........................] - ETA: 2s - loss: 0.929217/70 [======>.......................] - ETA: 2s - loss: 0.930019/70 [=======>......................] - ETA: 2s - loss: 0.930521/70 [========>.....................] - ETA: 2s - loss: 0.930823/70 [========>.....................] - ETA: 1s - loss: 0.931025/70 [=========>....................] - ETA: 1s - loss: 0.931227/70 [==========>...................] - ETA: 1s - loss: 0.931229/70 [===========>..................] - ETA: 1s - loss: 0.931231/70 [============>.................] - ETA: 1s - loss: 0.931133/70 [=============>................] - ETA: 1s - loss: 0.931135/70 [==============>...............] - ETA: 1s - loss: 0.931037/70 [==============>...............] - ETA: 1s - loss: 0.930939/70 [===============>..............] - ETA: 1s - loss: 0.930841/70 [================>.............] - ETA: 1s - loss: 0.930843/70 [=================>............] - ETA: 1s - loss: 0.930845/70 [==================>...........] - ETA: 0s - loss: 0.930947/70 [===================>..........] - ETA: 0s - loss: 0.930949/70 [====================>.........] - ETA: 0s - loss: 0.931051/70 [====================>.........] - ETA: 0s - loss: 0.931053/70 [=====================>........] - ETA: 0s - loss: 0.931054/70 [======================>.......] - ETA: 0s - loss: 0.931056/70 [=======================>......] - ETA: 0s - loss: 0.931058/70 [=======================>......] - ETA: 0s - loss: 0.931060/70 [========================>.....] - ETA: 0s - loss: 0.930962/70 [=========================>....] - ETA: 0s - loss: 0.930964/70 [==========================>...] - ETA: 0s - loss: 0.930965/70 [==========================>...] - ETA: 0s - loss: 0.930967/70 [===========================>..] - ETA: 0s - loss: 0.930869/70 [============================>.] - ETA: 0s - loss: 0.930870/70 [==============================] - 3s 41ms/step - loss: 0.9307 - val_loss: 0.9330

Learning rate for epoch 2 is 9.990009857574478e-05
Epoch 3/100
 1/70 [..............................] - ETA: 3s - loss: 0.9262 3/70 [>.............................] - ETA: 2s - loss: 0.9277 5/70 [=>............................] - ETA: 2s - loss: 0.9291 7/70 [==>...........................] - ETA: 2s - loss: 0.9303 9/70 [==>...........................] - ETA: 2s - loss: 0.931211/70 [===>..........................] - ETA: 2s - loss: 0.931713/70 [====>.........................] - ETA: 2s - loss: 0.931815/70 [=====>........................] - ETA: 2s - loss: 0.931717/70 [======>.......................] - ETA: 1s - loss: 0.931519/70 [=======>......................] - ETA: 1s - loss: 0.931321/70 [========>.....................] - ETA: 1s - loss: 0.931023/70 [========>.....................] - ETA: 1s - loss: 0.930825/70 [=========>....................] - ETA: 1s - loss: 0.930527/70 [==========>...................] - ETA: 1s - loss: 0.930329/70 [===========>..................] - ETA: 1s - loss: 0.930031/70 [============>.................] - ETA: 1s - loss: 0.929833/70 [=============>................] - ETA: 1s - loss: 0.929535/70 [==============>...............] - ETA: 1s - loss: 0.929337/70 [==============>...............] - ETA: 1s - loss: 0.929139/70 [===============>..............] - ETA: 1s - loss: 0.928941/70 [================>.............] - ETA: 1s - loss: 0.928843/70 [=================>............] - ETA: 1s - loss: 0.928745/70 [==================>...........] - ETA: 0s - loss: 0.928647/70 [===================>..........] - ETA: 0s - loss: 0.928649/70 [====================>.........] - ETA: 0s - loss: 0.928651/70 [====================>.........] - ETA: 0s - loss: 0.928653/70 [=====================>........] - ETA: 0s - loss: 0.928655/70 [======================>.......] - ETA: 0s - loss: 0.928557/70 [=======================>......] - ETA: 0s - loss: 0.928559/70 [========================>.....] - ETA: 0s - loss: 0.928461/70 [=========================>....] - ETA: 0s - loss: 0.928463/70 [==========================>...] - ETA: 0s - loss: 0.928465/70 [==========================>...] - ETA: 0s - loss: 0.928367/70 [===========================>..] - ETA: 0s - loss: 0.928369/70 [============================>.] - ETA: 0s - loss: 0.928270/70 [==============================] - 3s 38ms/step - loss: 0.9281 - val_loss: 0.9223

Learning rate for epoch 3 is 9.980039612855762e-05
Epoch 4/100
 1/70 [..............................] - ETA: 2s - loss: 0.9213 3/70 [>.............................] - ETA: 2s - loss: 0.9213 5/70 [=>............................] - ETA: 2s - loss: 0.9213 7/70 [==>...........................] - ETA: 2s - loss: 0.9213 9/70 [==>...........................] - ETA: 2s - loss: 0.921311/70 [===>..........................] - ETA: 2s - loss: 0.921313/70 [====>.........................] - ETA: 1s - loss: 0.921415/70 [=====>........................] - ETA: 1s - loss: 0.921517/70 [======>.......................] - ETA: 1s - loss: 0.921619/70 [=======>......................] - ETA: 1s - loss: 0.922021/70 [========>.....................] - ETA: 1s - loss: 0.922423/70 [========>.....................] - ETA: 1s - loss: 0.922925/70 [=========>....................] - ETA: 1s - loss: 0.923427/70 [==========>...................] - ETA: 1s - loss: 0.923729/70 [===========>..................] - ETA: 1s - loss: 0.924031/70 [============>.................] - ETA: 1s - loss: 0.924333/70 [=============>................] - ETA: 1s - loss: 0.924535/70 [==============>...............] - ETA: 1s - loss: 0.924637/70 [==============>...............] - ETA: 1s - loss: 0.924839/70 [===============>..............] - ETA: 1s - loss: 0.924841/70 [================>.............] - ETA: 1s - loss: 0.924943/70 [=================>............] - ETA: 0s - loss: 0.925045/70 [==================>...........] - ETA: 0s - loss: 0.925047/70 [===================>..........] - ETA: 0s - loss: 0.925149/70 [====================>.........] - ETA: 0s - loss: 0.925151/70 [====================>.........] - ETA: 0s - loss: 0.925153/70 [=====================>........] - ETA: 0s - loss: 0.925155/70 [======================>.......] - ETA: 0s - loss: 0.925157/70 [=======================>......] - ETA: 0s - loss: 0.925159/70 [========================>.....] - ETA: 0s - loss: 0.925161/70 [=========================>....] - ETA: 0s - loss: 0.925163/70 [==========================>...] - ETA: 0s - loss: 0.925165/70 [==========================>...] - ETA: 0s - loss: 0.925167/70 [===========================>..] - ETA: 0s - loss: 0.925169/70 [============================>.] - ETA: 0s - loss: 0.925270/70 [==============================] - 3s 37ms/step - loss: 0.9252 - val_loss: 0.9246

Learning rate for epoch 4 is 9.970089740818366e-05
Epoch 5/100
 1/70 [..............................] - ETA: 2s - loss: 0.9223 3/70 [>.............................] - ETA: 2s - loss: 0.9221 5/70 [=>............................] - ETA: 2s - loss: 0.9220 7/70 [==>...........................] - ETA: 2s - loss: 0.9219 9/70 [==>...........................] - ETA: 2s - loss: 0.921811/70 [===>..........................] - ETA: 2s - loss: 0.921713/70 [====>.........................] - ETA: 2s - loss: 0.921715/70 [=====>........................] - ETA: 2s - loss: 0.921617/70 [======>.......................] - ETA: 2s - loss: 0.921619/70 [=======>......................] - ETA: 1s - loss: 0.921621/70 [========>.....................] - ETA: 1s - loss: 0.921523/70 [========>.....................] - ETA: 1s - loss: 0.921525/70 [=========>....................] - ETA: 1s - loss: 0.921527/70 [==========>...................] - ETA: 1s - loss: 0.921429/70 [===========>..................] - ETA: 1s - loss: 0.921431/70 [============>.................] - ETA: 1s - loss: 0.921433/70 [=============>................] - ETA: 1s - loss: 0.921435/70 [==============>...............] - ETA: 1s - loss: 0.921437/70 [==============>...............] - ETA: 1s - loss: 0.921439/70 [===============>..............] - ETA: 1s - loss: 0.921441/70 [================>.............] - ETA: 1s - loss: 0.921543/70 [=================>............] - ETA: 0s - loss: 0.921745/70 [==================>...........] - ETA: 0s - loss: 0.921847/70 [===================>..........] - ETA: 0s - loss: 0.921949/70 [====================>.........] - ETA: 0s - loss: 0.922051/70 [====================>.........] - ETA: 0s - loss: 0.922053/70 [=====================>........] - ETA: 0s - loss: 0.922155/70 [======================>.......] - ETA: 0s - loss: 0.922257/70 [=======================>......] - ETA: 0s - loss: 0.922259/70 [========================>.....] - ETA: 0s - loss: 0.922361/70 [=========================>....] - ETA: 0s - loss: 0.922363/70 [==========================>...] - ETA: 0s - loss: 0.922465/70 [==========================>...] - ETA: 0s - loss: 0.922467/70 [===========================>..] - ETA: 0s - loss: 0.922469/70 [============================>.] - ETA: 0s - loss: 0.922470/70 [==============================] - 3s 38ms/step - loss: 0.9225 - val_loss: 0.9210

Learning rate for epoch 5 is 9.960159513866529e-05
Epoch 6/100
 1/70 [..............................] - ETA: 2s - loss: 0.9206 3/70 [>.............................] - ETA: 2s - loss: 0.9207 5/70 [=>............................] - ETA: 2s - loss: 0.9207